{
    "title": "My Experience with Programming on Weekends only",
    "date": "03-December-2022",
    "bannerImage": "../images/github-contribution-on-saturdays-and-sundays.png",
    "content": [
        {
            "type": "paragraph",
            "text": "It has been almost three months since I got admission in Higher Secondary School, I don't remember it by a date but by the pattern of my GitHub contribution graph. After the admission I found very little to no time for working on any of my Projects, so I decided to do that only on weekends."
        },
        {
            "type": "paragraph",
            "text": "The two of the projects I have been working on within this time are <a href='https://github.com/IshaqJunejo/radius2D' class='showcase'>Radius2D</a> (A custom physics engine) and my <a href='https://ishaqjunejo.github.io/'' class='showcase'>Portfolio Website</a>."
        },
        {
            "type": "heading",
            "level": "2",
            "text": "Progress of both Projects"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "Radius2D"
        },
        {
            "type": "paragraph",
            "text": "Radius2D is now capable of having circles finely react with each other, they also react fairly smoothly with lines and can also be connected through springs. There are currently two sample simulations, <a href='https://github.com/IshaqJunejo/radius2D/tree/main/Examples/SoftBodySimulation' class='showcase'>Circular Soft Body Simulation</a> and an <a href='https://github.com/IshaqJunejo/radius2D/tree/main/Examples/ClothSimulation' class='showcase'>Elastic Cloth Simulation</a>."
        },
        {
            "type": "paragraph",
            "text": "Soft Body Simulation uses a bunch of circles connected with each other by springs and form a circular shape, which is then dropped from a position which makes the Soft Body feel jiggly."
        },
        {
            "type": "paragraph",
            "text": "Cloth Simulation uses a lot of circles ( with zero radius ) connected with each other using springs and forming a rectangular structure. It also uses keyboard input of showing the wind effect and mouse input for tearing the cloth apart by removing springs from the list."
        },
        {
            "type": "paragraph",
            "text": "I also have made a small YouTube Video about how I made this Simulation."
        },
        {
            "type": "iframe",
            "style": "display:block; margin-top:36px; margin-right:auto; margin-left:auto; min-width: 200px; max-width: 70%; border-radius:20px;",
            "src": "https://youtube.com/embed/XHCzh0ynHk0"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "Portfolio"
        },
        {
            "type": "paragraph",
            "text": "My portfolio website was started on 4th of September and was deployed on 8th of September this year, since then I had been tweaking it's design constantly."
        },
        {
            "type": "paragraph",
            "text": "As design of Projects section have been changed so it looks better with narrow screens. On the Left it is Older View of Project's section, on the Right it is the New one."
        },
        {
            "type": "image",
            "src": "../images/redesign-of-projects-section.png",
            "alt": "I redesigned the Projects Section of my website"
        },
        {
            "type": "paragraph",
            "text": "Blogs section design have also been tweaked to show initial few words of the blog post. On the Left is Older View and on Right is the tweaked one."
        },
        {
            "type": "image",
            "src": "../images/redesign-of-blogs-section.png",
            "alt": "Blogs Section of my website have been redesigned"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "Future of Radius2D"
        },
        {
            "type": "paragraph",
            "text": "This was started just for the purpose of learning experience and also for fun which is why I don't have any specific goals for it, but something I would want to do to carry on the GitHub contribution graph's pattern I would probably add some more objects of different shapes like those of Axis-Aligned Bounding-Box (AABB) and Separating-Axis-Theorem (SAT) and most probably Capsules too."
        },
        {
            "type": "paragraph",
            "text": "Other than that I don't have any specific goals for my website too other just adding a Pixel Art Section on the Homepage."
        },
        {
            "type": "paragraph",
            "text": "Anyways if you want to try out Radius2D, you can download the <a href='https://www.nuget.org/packages/MIJGames.Radius2D/1.0.1' class='showcase'>NuGet Package For Radius2D</a>."
        }
    ]
}