{
    "title": "2023 Year in Review",
    "date": "28-December-2023",
    "bannerImage": "../images/2023-Annual-Review-Banner.png",
    "content": [
        {
            "type": "paragraph",
            "text": "As the year 2023 is coming to an end, it is time to reflect on what the previous twelve months have been like and reflect on my goals for this year. This year has made me realize that some chapters of our journey don't unfold as planned (and that maybe I am lazier than I prefer to think of myself). The echoes of unfinished aspirations serve as sad reminders of the unpredictable nature of our paths and the humbling truth that not every goal is supposed to be achieved in our predetermined destiny."
        },
        {
            "type": "heading",
            "level": "2",
            "text": "First Quarter"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "14th of January"
        },
        {
            "type": "paragraph",
            "text": "I navigated around my computer, collected all of the old Python projects, and uploaded them all into one single private GitHub repository."
        },
        {
            "type": "heading",
            "level": "3",
            "text": "6th of January - 26th of March"
        },
        {
            "type": "paragraph",
            "text": "These were the only 80 days of the Year I did Journaling before bed, adding a little more, I only did journaling in 34 of the days in these 80 days."
        },
        {
            "type": "heading",
            "level": "3",
            "text": "23rd of March - 29th of March"
        },
        {
            "type": "paragraph",
            "text": "These days, I replicated my portfolio website's desktop design into a Figma design and tried to look for some spots where I could get it a bit improved. The changes that I made in the design were in the Blog Section, the Project Section, and also a few more things, you can read more about it."
        },
        {
            "type": "link",
            "href": "../improving-the-layout-of-my-website/",
            "text": "Improving the Layout of my Website"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "25th of March - 31st of March"
        },
        {
            "type": "paragraph",
            "text": "I tried to implement the things I learned from working on a Physics Engine into a new project. So I made a Basic Gravity Simulator and just added a Basic Collision Response system for Circle to Circle. I also added a way so that I can add more Objects to the simulation while it is running. In the end, I added a Star (basically an Object with a big mass) and added a bunch of small objects orbiting around the star in 2 different rings."
        },
        {
            "type": "heading",
            "level": "2",
            "text": "Second Quarter"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "15th of April - 1st of May"
        },
        {
            "type": "paragraph",
            "text": "I tried working on the Separating Axis Theorem or SAT for the Physics Engine. SAT is an algorithm in which we measure the angle of every edge of both the Closed Convex Polygons in being detected, and Mathematically assume an axis in that angle and in the perpendicular and check if both the Polygons are separated in the axis or not. If they are separated in any one of the axes, we say these Polygons are not colliding."
        },
        {
            "type": "heading",
            "level": "2",
            "text": "Third Quarter"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "8th of September - 27th of September"
        },
        {
            "type": "paragraph",
            "text": "I also built my first-ever Neural Network, which was trained and tested on the standard MNIST Dataset (Modified National Institute of Standards and Technology dataset), a dataset of thousands of handwritten digits on 28 by 28 pixels. The Neural Network had 784 Input Neurons, 10 Neurons in the Hidden Layer, and 10 Neurons in the Output Layer."
        },
        {
            "type": "paragraph",
            "text": "I also have a blog about Working on my First Neural Network."
        },
        {
            "type": "link",
            "href": "../Working-on-my-First-Neural-Network/",
            "text": "Working on my First Neural Network"
        },
        {
            "type": "heading",
            "level": "2",
            "text": "Fourth Quarter"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "1st of October - 17th of October"
        },
        {
            "type": "paragraph",
            "text": "I also tried to expand the Neural Network from 2 Layers to 3 Layers, 2 Hidden Layers with 16 Neurons each and 10 Neurons in Output Layer. I made changes to all the functions working on Layers (Initializing Parameters, Forward-Propagation, Back-Propagation, and Updating Parameters). As I tried to Train the Network and was being shown its accuracy, it was fluctuating around instead of gradually climbing. I knew there was some problem with the Back-Propagation Function or it was supposed to be written a different way maybe, but I still haven't figured it out."
        },
        {
            "type": "paragraph",
            "text": "I also wrote about it."
        },
        {
            "type": "link",
            "href": "../Failed-attempt-to-expand-Neural-Network/",
            "text": "Failed Attempt to Expand a Neural Network"
        },
        {
            "type": "heading",
            "level": "3",
            "text": "20th of December - Still"
        },
        {
            "type": "paragraph",
            "text": "I am working on a small project, which I uploaded into a new Private GitHub Repository on the 23rd of December. I don't want to share a lot about it right now, but it has something to do with Mathematics."
        },
        {
            "type": "heading",
            "level": "2",
            "text": "Conclusion"
        },
        {
            "type": "list",
            "items": [
                {
                    "type": "paragraph",
                    "text": "Journaled only for 34 days of the year."
                },
                {
                    "type": "paragraph",
                    "text": "Redesigned my Portfolio Website with the same Color Scheme."
                },
                {
                    "type": "paragraph",
                    "text": "Implemented Separating Axis Theorem on my Physics Engine."
                },
                {
                    "type": "paragraph",
                    "text": "Worked on my First Neural Network."
                },
                {
                    "type": "paragraph",
                    "text": "Wrote 4 blogs."
                },
                {
                    "type": "paragraph",
                    "text": "Made almost 80 contributions to my Projects on GitHub."
                }
            ]
        },
        {
            "type": "heading",
            "level": "2",
            "text": "Reflecting on the Goals"
        },
        {
            "type": "list",
            "items": [
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Contribute to Open-Source Projects"
                        },
                        {
                            "type": "paragraph",
                            "text": "I wanted to try to work with someone else working on something open-source on GitHub to learn and understand more about collaborative programming."
                        },
                        {
                            "type": "paragraph",
                            "text": "I failed at even trying this, I guess I didn't even try to look for some fresh open-source projects on GitHub."
                        }
                    ]
                },
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Write 12 Blogs"
                        },
                        {
                            "type": "paragraph",
                            "text": "I wanted to try something new in the Field of Tech each month and write a short blog about that. It was a way to push myself to try something new each month."
                        },
                        {
                            "type": "paragraph",
                            "text": "I also failed at this one, because I wrote only 4 blogs this year. Only one of these 4 blogs was published in the First Quarter and the other 3 in the Last Quarter, showing quite inactivity in the middle of the year."
                        }
                    ]
                },
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Work on an A.I or M.L Based Project"
                        },
                        {
                            "type": "paragraph",
                            "text": "I set this goal because I was interested in it a year ago, so I wanted to learn about it and work on something related to it. I was more interested in the Genetic Algorithm."
                        },
                        {
                            "type": "paragraph",
                            "text": "The only thing I did this year related to AI or Machine Learning was to work on a simple Neural Network with MNIST Dataset, and a failed attempt to expand it. So I am going to count this one as a success."
                        }
                    ]
                },
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Get Back to Journaling My Days"
                        },
                        {
                            "type": "paragraph",
                            "text": "I realized Journaling positively impacted my productivity, so I planned to make Journaling my habit."
                        },
                        {
                            "type": "paragraph",
                            "text": "I only Journaled for 34 days and only in the Initial 3 months. I would also blame not Journaling for being so unproductive during the Mid-Year."
                        }
                    ]
                }
            ]
        },
        {
            "type": "heading",
            "level": "2",
            "text": "Goals for 2024"
        },
        {
            "type": "list",
            "items": [
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Contribute to Open-Source Projects"
                        },
                        {
                            "type": "paragraph",
                            "text": "Even though I couldn't do it this year, I still think it would be a great idea to be working on an open-source project with someone else, as it can improve my programming skills and also give me a collaborative development experience."
                        }
                    ]
                },
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Work on a Personal Project"
                        },
                        {
                            "type": "paragraph",
                            "text": "I'll also try to work on a Personal Project, it is most probably going to be one related to Maths, that I talked a little about working on. Or I might also try to work on something completely new."
                        }
                    ]
                },
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Journaling my Days"
                        },
                        {
                            "type": "paragraph",
                            "text": "I regret my procrastination in not journaling before bed for most of the year, so I also plan to journal my days in the coming year, but instead of writing them digitally  I plan to have a physical journal for this purpose."
                        }
                    ]
                },
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Regular Physical Exercise"
                        },
                        {
                            "type": "paragraph",
                            "text": "I now have this habit of doing a few push-up reps before lunch on weekdays and before breakfast on weekends. It is also plan to keep this habit in the coming year as I have realized it is keeping me from being lazy."
                        }
                    ]
                },
                {
                    "type": "div",
                    "children": [
                        {
                            "type": "heading",
                            "level": "3",
                            "text": "Write more Blogs than I did this Year"
                        },
                        {
                            "type": "paragraph",
                            "text": "This Year's goal of writing 1 blog each month has failed quite badly, so this time instead of saying I am going to write X number of blogs next year, I am going to say I'll try to write more blogs next year than I have written this year."
                        }
                    ]
                }
            ]
        }
    ]
}